Repository: pypi-data/pypi-mirror-73
Catalog: packages/*.video/*.video-3.1.tar.gz/*.video-3.1/*/video/locales/*/LC_MESSAGES/*.video.po
Languages: es, eu

source: Activate VideoFolderness
es: Activar Carpeta de Videos
eu: Bideo karpeta izatea aktibatu

source: Deactivate VideoFolderness
es: Deactivar Carpeta de Videos
eu: Bideo karpeta izatea desaktibatu

source: Duration
es: Duración
eu: Iraupena

source: Enter the duration in seconds
es: Introducir duración en en segundos
eu: Bideoaren iraupena segundotan

source: Image
es: Imagen
eu: Irudia

source: Is panoramic?
es: ¿Es panorámico?
eu: Panoramikoa da?

source: Paste here the URL fo the flash video
es: Copie aquí la dirección del vídeo
eu: Kopiatu hemen fitxategiaren helbidea

source: Select if this video is in 16:9 format instead on 4:3
es: Seleccionar si el video está en formato 16:9 en vez de 4:3
eu: Aukeratu bideoa 16:9 formatuan badago 4:3 beharrean

source: URL
eu: URLa

source: Video Folder activated
es: Activado el modo carpeta de vídeos
eu: Bideo karpeta aktibatuta

source: Video Folder deactivated
es: Desactivado el modo carpeta de vídeos
eu: Bideo karpeta desaktibatuta

source: Video object for referring external FLV files
es: Objeto que hace referencia a archivos FLV externos
eu: Kanpoko FLV bideoei erreferentzia egiten dien objektua

source: label_more_videos
es: Más vídeos...
eu: Bideo gehiago...

source: label_video_feed
es: Feed de vídeos
eu: Bideoen XML jarioa
